##ΕΠΑΝΑΛΗΠΤΙΚΕΣ ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ ΚΑΙ ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΣΑΒΒΑΤΟ 26 ΣΕΠΤΕΜΒΡΙΟΥ 2026
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ B
##B1. Να γράψετε στο τετράδιό σας τις τιμές που εμφανίζονται κατά την
##εκτέλεση του παρακάτω προγράμματος:
##S=0
##for i in range(1,6):
##    if i%2==0:
##        S=S+2*i
##    else:
##        S=S+i
##    print i,S
##Μονάδες 10

S=0
for i in range(1,6):
    if i%2==0:
        S=S+2*i
    else:
        S=S+i
    print(i,S)

##1 1
##2 5
##3 8
##4 16
##5 21

##B2. Να γράψετε στο τετράδιό σας τους αριθμούς (1), (2), (3), (4) και (5)
##που αντιστοιχούν στα κενά της παρακάτω συνάρτησης και δίπλα τις
##σωστές εκφράσεις, ώστε η συνάρτηση plithos_OY να επιστρέφει το πλήθος
##των εμφανίσεων της συμβολοσειράς “OY” μέσα στη λέξη w.
##def plithos_OY(w):
##    p=0
##    for i in range ( (1) ):
##        if w[ (2) ] == (3) and w[i+1] == (4) :
##            p=p+1
##    return (5)
##Για παράδειγμα η κλήση plithos_OY("MOYSTOKOYLOYRO") επιστρέφει 3.
##Μονάδες 15

def plithos_OY(w):
    p=0
    for i in range(len(w)-1):
        if w[i] == 'O' and w[i+1] == 'Y' :
            p=p+1
    return p
print(plithos_OY("MOYSTOKOYLOYRO"))

##def plithos_OY(w):
##    p=0
##    for i in range( (1) ):    ## (1) len(w)-1
##        if w[ (2) ] == (3) and w[i+1] == (4) :    ## (2) i, (3) 'O',(4) 'Y'
##            p=p+1
##    return (5)    ## (5) p
