##ΕΠΑΝΑΛΗΠΤΙΚΕΣ ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ ΚΑΙ ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΣΑΒΒΑΤΟ 26 ΣΕΠΤΕΜΒΡΙΟΥ 2026
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ A
##Α2. Να γράψετε στο τετράδιό σας τους αριθμούς 1, 2, 3, 4, 5 από τη
##στήλη Α του παρακάτω πίνακα και δίπλα σε καθέναν από τους αριθμούς,
##ένα από τα γράμματα α, β, γ, δ, ε, στ της στήλης Β, που δίνει τη σωστή
##αντιστοίχιση. Σημειώνεται ότι ένα γράμμα από τη στήλη Β θα περισσέψει.
##Δίνεται η λίστα L=[6, 28, 496, 8128].
##ΣΤΗΛΗ Α	    	        ΣΤΗΛΗ Β
##1. len(L)	    	        α. False
##2. len(str(L[2]))	    	β. 4
##3. L[0]+L[1]	    	        γ. [28, 496]
##4. L[1:3]	    	        δ. True
##5. not(4 in L)	    	ε. 34
##	    	                στ. 3
##Μονάδες 10
##
##print L
##print len(L)
##print len(str(L[2]))
##print L[0]+L[1]
##print L[1:3]
##print not(4 in L)
##
##[6, 28, 496, 8128]
##4
##3
##34
##[28, 496]
##False
##
##1. len(L)	    	        β. 4
##2. len(str(L[2]))	    	στ. 3
##3. L[0]+L[1]	    	        ε. 34
##4. L[1:3]	    	        γ. [28, 496]
##5. not(4 in L)	    	α. False
